back-end/app/controllers/api/v1/tasks_controller.rb

            def index
                tasks = Task.order('day ASC');
---
SELECT "tasks".* FROM "tasks" ORDER BY day DESC